#! /bin/bash -

############################################################
# shift, getopts


############################################################
# expr -> 非推奨


############################################################
# eval -> 文字列に格納したコマンドが上手く解釈されない場合に有効
echo "##### eval ##############################"
listpage="ls | more"
# $listpage    # ls: cannot access '|': No such file or directory
eval $listpage

############################################################
# サブシェル    : 別プロセス
# コードブロック: 同じプロセスで実行
echo "##### block ##############################"
# サブシェル
(cd /mnt ; ls -l)    # 別プロセス
ls -l                # なので別プロセスの cd はこっちに反映されない

# コードブロック
cd /not_exist || {
    echo "failed: cd /not_exist"
}

############################################################
# cvs / rcs : バージョン管理システム



