#! /bin/bash -

############################################################
# printf
echo "##### printf ##############################"
printf "hello world. %s %s\n" Hello World

############################################################
# tr: 文字の置き換え
#   -d: 削除
echo "##### tr ##############################"
TMP="string"
TMP2=$(echo $TMP | tr -d "s")
echo $TMP2    # tring
TMP2=$(echo $TMP | tr "s" "t")
echo $TMP2    # ttring

############################################################
# sed : ストリームデータを編集して標準出力に出力
#   -e : コマンド
#   -f : コマンドをファイルから読む
#   -n : 修正後の行を出力しない
echo "##### sed ##############################"
ls -l ../../ | grep -E ".txt" | sed "s/.txt//"
echo "----"
ls -l ../../ | grep -E ".txt" | sed "s;.txt;;"             # 区切り文字は ; : , でもOK、ファイルパスをいじる場合等
echo "----"
ls -l ../../ | grep -E ".txt" | sed "s/w/#####/g"          # g をつけると見つかった場所全てを置換する(global)
echo "----"
ls -l ../../ | grep -E ".txt" | sed "s/w/#####/2"          # 2番目に見つかった場所を置換する
echo "----"
cat re_test.txt | sed -e "s/a/#/g" -e "s/why/why not/g"    # コマンドの分割
echo ""
echo "----"
sed 2q re_test.txt    # head の実装
echo "----"
cat re_test.txt | sed -e 's/t[[:alpha:]]*y/Camus/'         # t*yだと全部マッチするので範囲指定

############################################################
# cut : ファイルからデータを切り出す
#   -c : 文字単位
#   -d : delimiter, ブロックとして切り出したい場合
#   -f : -dと併用してフィールド単位で切り出す
echo "##### cut ##############################"
cut -c 2-4 re_test.txt    # 1行につき 2-4 の範囲を切り出し
echo "----"
cut -d : -f 3,6 /etc/passwd

############################################################
# awk : ファイルの1行毎に処理を実行
#   -F : 区切り文字指定
echo "##### awk ##############################"
awk -F: '{ print $1, $6 }' /etc/passwd

############################################################
# sort : 並び替え
#   -d : 辞書順に並び替え
#   -o : 結果をファイルに出力
#   -r : 降順ソート
echo "##### sort ##############################"
sort -d re_test.txt

############################################################
# uniq : 重複の排除

############################################################
# wc : 行数、文字数、単語数のカウント
echo "##### wc ##############################"
cat re_test.txt | wc -c    # バイト数
cat re_test.txt | wc -m    # 文字数
cat re_test.txt | wc -l    # 行数
cat re_test.txt | wc -w    # 単語数

############################################################
# tee : 入力値を、引数指定されたファイル全てと標準出力に書き出す
#       プロセス展開を出力に回すのに便利
# echo "##### tee ##############################"
# # これだとプロンプトには出てこない
# ls -l | tee >(sort -r > r_sorted_data.txt) \
#             > raw_data.txt
